import 'package:flutter/material.dart';

class MainPage extends StatelessWidget{
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('main_page'),
        centerTitle: true,
      ),
      body: Container(
        child: ListView(
          padding: EdgeInsets.all(35),
          children: const [
            Text(
                'Не следует, однако, забывать о том, что выбранный нами инновационный путь позволяет оценить значение существующих финансовых и административных условий. Значимость этих проблем настолько очевидна, что социально-экономическое развитие позволяет выполнить важнейшие задания по разработке экономической целесообразности принимаемых решений! Соображения высшего порядка, а также курс на социально-ориентированный национальный проект играет важную роль в формировании новых предложений!Дорогие друзья, реализация намеченного плана развития напрямую зависит от системы масштабного изменения ряда параметров. Значимость этих проблем настолько очевидна, что постоянный количественный рост и сфера нашей активности требует от нас анализа ключевых компонентов планируемого обновления. Соображения высшего порядка, а также начало повседневной работы по формированию позиции в значительной степени обуславливает создание существующих финансовых и административных условий. Равным образом консультация с профессионалами из IT способствует повышению актуальности ключевых компонентов планируемого обновления.Задача организации, в особенности же консультация с профессионалами из IT способствует подготовке и реализации системы обучения кадров, соответствующей насущным потребностям. Таким образом, выбранный нами инновационный путь требует от нас анализа дальнейших направлений развития проекта. Таким образом, постоянное информационно-техническое обеспечение нашей деятельности требует от нас анализа новых предложений. С другой стороны постоянный количественный рост и сфера нашей активности способствует подготовке и реализации модели развития.Практический опыт показывает, что дальнейшее развитие различных форм деятельности способствует подготовке и реализации...'
            )
          ],
        ),
      ),
    );
  }
}
